#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖``

<details><summary>Show Plan</summary>

```

Packing local workspace...
Uploading local workspace...
You have successfully created a local preview run!
The live run can be visited at https://liquibase.app.spacelift.io/stack/liquibase-ansible/run/01HSB167SKXW7C4RYHRZ62BEPV

-----------------
QUEUED	Tue Mar 19 09:37:57 UTC 2024
-----------------


-----------------
READY	Tue Mar 19 09:37:57 UTC 2024
-----------------


-----------------
PREPARING	Tue Mar 19 09:37:58 UTC 2024
-----------------

[0;36m[Ground Control] [0mThis is Ground Control to public worker 01HSB0R54T2592BBW9BMH8DC1H, commencing countdown
[0;36m[Ground Control] [0mNo initialization policies attached
[0;36m[Ground Control] [0mCreating metadata...
[0;36m[Ground Control] [0mUploading metadata...
[0;36m[Ground Control] [0mMetadata is GO
[0;36m[Ground Control] [0mCreating workspace...
[0;36m[Ground Control] [0mEncrypting workspace...
[0;36m[Ground Control] [0mUploading workspace...
[0;36m[Ground Control] [0mWorkspace is GO
[0;36m[Ground Control] [0mWe're ready 01HSB0R54T2592BBW9BMH8DC1H
[0;36m[Ground Control] [0mOver to you 01HSB0R54T2592BBW9BMH8DC1H, we'll see you on the other side
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mMic check 1 2, is this thing on?
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mThis is 01HSB0R54T2592BBW9BMH8DC1H to Ground Control, I'm on
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mDownloading and decrypting workspace...
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mUnpacking the workspace...
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mWorkspace is GO
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mReading static run environment file...
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mStatic run environment is GO
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mDownloading metadata...
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mMetadata is GO
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mDownloading source code...
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mSource code is GO
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mSetting up mounted files...
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mMounted files are GO
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mConfiguring file permissions...
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mPermissions are GO
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mEvaluating run initialization policy...
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mNo initialization policies attached
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mDocker image is not cached
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mPulling Docker image public.ecr.aws/spacelift/runner-terraform:latest...
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mPulling from spacelift/runner-terraform
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mDigest: sha256:8a6b5b541f959a75f86485a9461324f063d087f84191a6d0cfad2800d6e96d1f
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mStatus: Downloaded newer image for public.ecr.aws/spacelift/runner-terraform:latest
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mDocker image is GO (digest: 8a6b5b541f95)
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mDownloading Terraform 1.5.7...
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mTerraform 1.5.7 download is GO (/bin/terraform)
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mCreating Docker container...
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mStarting Docker container...
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mDocker container is GO
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mVerifying container image prerequisites...
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mSuccessfully verified container image prerequisites
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mUsing Terraform workflow...

-----------------
INITIALIZING	Tue Mar 19 09:38:04 UTC 2024
-----------------

[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mUsing binary "terraform" from /bin/terraform
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mMerging .terraformrc files...
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0m.terraformrc files merged successfully
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mInitializing workspace with 0 custom hooks...

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "http"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v5.41.0...
- Installed hashicorp/aws v5.41.0 (signed by HashiCorp)

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mWorkspace is GO
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mRemote backend "http" configured
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mInfracost is enabled for this stack - checking for binary and API key
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mUsing binary "infracost" from /bin/infracost
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0m"INFRACOST_API_KEY" environment variable found
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mInfracost is GO

-----------------
PLANNING	Tue Mar 19 09:38:21 UTC 2024
-----------------

[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mPlanning changes with 0 custom hooks...
[0m[1mdata.aws_ami.ubuntu: Reading...[0m[0m
[0m[1mdata.aws_ami.ubuntu: Read complete after 0s [id=ami-0f8b8f874036055b1][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_instance.this["ansible_role_instance_1"][0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "this" {
      [32m+[0m[0m ami                                  = "ami-0f8b8f874036055b1"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = true
      [32m+[0m[0m availability_zone                    = (known after apply)
      [32m+[0m[0m cpu_core_count                       = (known after apply)
      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)
      [32m+[0m[0m disable_api_stop                     = (known after apply)
      [32m+[0m[0m disable_api_termination              = (known after apply)
      [32m+[0m[0m ebs_optimized                        = (known after apply)
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_lifecycle                   = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t2.micro"
      [32m+[0m[0m ipv6_address_count                   = (known after apply)
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = "ec2"
      [32m+[0m[0m monitoring                           = (known after apply)
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = (known after apply)
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m source_dest_check                    = true
      [32m+[0m[0m spot_instance_request_id             = (known after apply)
      [32m+[0m[0m subnet_id                            = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name" = "ansible_role_instance_1"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Name" = "ansible_role_instance_1"
        }
      [32m+[0m[0m tenancy                              = (known after apply)
      [32m+[0m[0m user_data                            = (known after apply)
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = false
      [32m+[0m[0m vpc_security_group_ids               = (known after apply)
    }

[1m  # aws_instance.this["ansible_role_instance_2"][0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "this" {
      [32m+[0m[0m ami                                  = "ami-0f8b8f874036055b1"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = true
      [32m+[0m[0m availability_zone                    = (known after apply)
      [32m+[0m[0m cpu_core_count                       = (known after apply)
      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)
      [32m+[0m[0m disable_api_stop                     = (known after apply)
      [32m+[0m[0m disable_api_termination              = (known after apply)
      [32m+[0m[0m ebs_optimized                        = (known after apply)
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_lifecycle                   = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t2.micro"
      [32m+[0m[0m ipv6_address_count                   = (known after apply)
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = "ec2"
      [32m+[0m[0m monitoring                           = (known after apply)
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = (known after apply)
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m source_dest_check                    = true
      [32m+[0m[0m spot_instance_request_id             = (known after apply)
      [32m+[0m[0m subnet_id                            = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name" = "ansible_role_instance_2"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Name" = "ansible_role_instance_2"
        }
      [32m+[0m[0m tenancy                              = (known after apply)
      [32m+[0m[0m user_data                            = (known after apply)
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = false
      [32m+[0m[0m vpc_security_group_ids               = (known after apply)
    }

[1m  # aws_instance.this["ansible_role_instance_3"][0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "this" {
      [32m+[0m[0m ami                                  = "ami-0f8b8f874036055b1"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = true
      [32m+[0m[0m availability_zone                    = (known after apply)
      [32m+[0m[0m cpu_core_count                       = (known after apply)
      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)
      [32m+[0m[0m disable_api_stop                     = (known after apply)
      [32m+[0m[0m disable_api_termination              = (known after apply)
      [32m+[0m[0m ebs_optimized                        = (known after apply)
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_lifecycle                   = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t2.micro"
      [32m+[0m[0m ipv6_address_count                   = (known after apply)
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = "ec2"
      [32m+[0m[0m monitoring                           = (known after apply)
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = (known after apply)
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m source_dest_check                    = true
      [32m+[0m[0m spot_instance_request_id             = (known after apply)
      [32m+[0m[0m subnet_id                            = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name" = "ansible_role_instance_3"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Name" = "ansible_role_instance_3"
        }
      [32m+[0m[0m tenancy                              = (known after apply)
      [32m+[0m[0m user_data                            = (known after apply)
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = false
      [32m+[0m[0m vpc_security_group_ids               = (known after apply)
    }

[1m  # aws_key_pair.ssh_key[0m will be created
[0m  [32m+[0m[0m resource "aws_key_pair" "ssh_key" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m fingerprint     = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m key_name        = "ec2"
      [32m+[0m[0m key_name_prefix = (known after apply)
      [32m+[0m[0m key_pair_id     = (known after apply)
      [32m+[0m[0m key_type        = (known after apply)
      [32m+[0m[0m public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDHu7/QK1alb4qIWV2NAxgnVo1dE81n4wpy0yWcmqoOM4Mtf0Y1g9QOqyOK36mKeEc5y70cZvcWsHpgT+l31o9Roi11EdTWWHlkHt3wDYRwN0OzUHuLb3sUG1q+sfz+/AKgLe96XTDqEHWJzYL/MWb1oC9UKegk0svPnorl/yYNuFLjQuvUXP0WmQzDMAH6plaRGN1tIBVnqzPywio7W2akimkXTA8fb3qjH//YAYLuOitH9B8M6xrFmdDkRHUHiAIwkx6lFALZi++OXh/DjAtfKvBVmDyZOxE8qOQ5PjKEOX/Pj/KAFGX2NfLIQnZB8OphHpZPTckzZs9RkGA6XG6r"
      [32m+[0m[0m tags_all        = (known after apply)
    }

[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m aws_instances = [
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
    ]
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mChanges are GO
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mUploading the list of managed resources...
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mGenerating Infracost JSON report from plan

[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mInfracost report generated successfully
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mMapping Infracost data to resources
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mCosts mapped successfully
[0;33m[01HSB0R54T2592BBW9BMH8DC1H] [0mPlease be aware that the run changes calculation includes output changes.
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mResource list upload is GO
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mGenerating JSON representation of the plan...
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mJSON representation is GO
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mGenerating Infracost JSON report from plan

[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mInfracost report generated successfully
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mLoading custom plan policy inputs...
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0m0 custom plan policy inputs found
[0;36m[01HSB0R54T2592BBW9BMH8DC1H] [0mNo plan policies to evaluate

-----------------
FINISHED	Tue Mar 19 09:38:55 UTC 2024
-----------------

View full logs at https://liquibase.app.spacelift.io/stack/liquibase-ansible/run/01HSB167SKXW7C4RYHRZ62BEPV

```

</details>


*Pusher: @jandroav, Action: `pull_request`, Working Directory: `/home/runner/work/liquibase-ansible/liquibase-ansible`, Workflow: `Deploy AWS infra and test the role`*